app/views/logins/show.html.erb

    <%= form.label :account_type, style: "display: block" %>
    <%= form.select :account_type, [["Volunteer", "volunteer"], ["Admin", "admin"]], selected: "volunteer" %>
---
SELECT "admins".* FROM "admins" ORDER BY "admins"."id" ASC LIMIT 1