app/controllers/admin_volunteers_controller.rb

  def index
    @volunteers = Volunteer.order(:full_name)
---
SELECT "volunteers".* FROM "volunteers" ORDER BY "volunteers"."full_name" ASC

  def set_volunteer
    @volunteer = Volunteer.find(params[:id])
---
SELECT "volunteers".* FROM "volunteers" WHERE "volunteers"."id" IS NULL LIMIT 1