app/controllers/admin_volunteer_assignments_controller.rb

SELECT "volunteer_assignments".* FROM "volunteer_assignments" ORDER BY "volunteer_assignments"."created_at" DESC
---
  def index
    @volunteer_assignments = VolunteerAssignment.includes(:volunteer, :event).order(created_at: :desc)

SELECT "volunteers".* FROM "volunteers" ORDER BY "volunteers"."full_name" ASC
SELECT "events".* FROM "events" WHERE "events"."status" != 3 ORDER BY "events"."event_date" ASC, "events"."start_time" ASC
---
  def set_assignment_collections
    @volunteers = Volunteer.order(:full_name)
    @events = Event.where.not(status: :cancelled).order(:event_date, :start_time)