app/controllers/logins_controller.rb

SELECT "admins".* FROM "admins" ORDER BY "admins"."id" ASC LIMIT 1
---
  def authenticate_admin
    admin = Admin.first