app/models/admin.rb

  def single_admin_record
    errors.add(:base, "Only one admin account is allowed") if Admin.exists?
---
SELECT 1 AS one FROM "admins" LIMIT 1